{"page_1_text_1":"THE","page_1_text_2":"HOME","page_1_text_3":"BUYING","page_1_text_4":"GUIDE","page_3_text_1":"A New Breed of Realtors Redefining","page_3_text_2":"The Real Estate","page_3_text_3":"Experience","page_3_text_4":"At LUXE Properties, we take pride in building relationships based on the premise and understanding that each client is unique, along with their respective properties. We aim to delight and surprise our clients, deliver exceptional service and exceed expectations throughout the transaction. Our company utilizes the latest technology to stay abreast of market trends and deliver innovative solutions for our LUXE clients.","page_3_text_5":"The LUXE Properties team seeks to partner with you every step of the way. So, whether you are buying, selling, or considering real estate in South Florida, LUXE Properties is here to make your LUXE real estate experience your best move yet.","page_4_text_1":"We Are Your Advisor","page_4_text_2":"We will identify homes that represent the best value and also match your needs.\r\n                    Advise on different options for ﬁnancing and provide comparable homes to determine fair market value.\r\n                    Research the history of the homes you are interested in and request a proper seller’s disclosure.\r\n                    Guide you on any trends or developments in your areas of interest along with possible off market or coming soon opportunities.","page_4_text_3":"Responsiveness","page_4_text_4":"We answer the phone! We will get back to you no later than the same day.\r\n                    Our team has buyer agents with open availability to show homes at your preference.\r\n                    We will attend inspections, appraisals and closing.\r\n                    Once you have found the one, we also have an assigned closing coordinator to assist with follow up from contract to closing.","page_4_text_5":"Negotiator","page_4_text_6":"We are expert negotiators and will always negotiate on your behalf along with transparency on how negotiations progress.\r\n                    Compile market analysis data and comparable data from recent sales in area to decide on the strongest and most competitive offer.\r\n                    Research seller’s objectives and needs prior to negotiating in order to develop the best strategy in the event of a counteroffer.\r\n                    Guide you through additional negotiations if needed during inspection and appraisal.\r\n                    Work with lenders and title companies to make sure any fees charged are fair and in line with going prices.","page_9_text_1":"LUXE CAN PROVIDE ALL OF THE TOOLS YOU NEED FOR PRODUCTIVE PROPERTY SEARCHES, INCLUDING:","page_9_text_2":"Ability to search at your leisure\r\n                    Direct data straight from our MLS system\r\n                    Concierge-style automatic notifications of new homes\r\n                    Real time dynamic search functionality\r\n                    Display of all property listing data on the map according to the search characteristics from your selection\r\n                    The ability to draw custom search boundaries using the interactive ‘polygon’ search tool\r\n                    Point-of-Interest Plotting, enabling the buyer to search for area shops, services and amenities such as restaurants and schools\r\n                    Satellite photos of entire search areas as well as close-up ‘Street-view’ photographs of any neighborhood\r\n                    Market data and statistics for recent sales\r\n                    Relevant information that aligns with your LUXE lifestyle. Categories include Events, Restaurants, Things to Do, Theatre and Arts, Music and Concerts and Sports","page_11_text_1":"The Most Common Loans","page_11_text_2":"There is no easy answer to which loan is the best. You should review all options and pick what is best for you.","page_11_text_3":"FHA","page_11_text_4":"This is a low down payment option, sometimes only 3.5% down\r\n                    Accepts lower credit scores and high qualifying ratios allowing you to purchase higher up to the loan limit.\r\n                    This loan does have mortgage insurance for the life of the loan\r\n                    Condos must be FHA approved to qualify and the amount in each county that are approved is quite low\r\n                    You do not need to be a first-time homebuyer","page_11_text_5":"VA","page_11_text_6":"This loan has the same guidelines as FHA for the property.\r\n                    The borrower must be a veteran and receive special financing incentives.\r\n                    Loan amount can be up to 100%.","page_11_text_7":"Conventional","page_11_text_8":"These loans can be used for investment loans or owner occupants.\r\n                    Lower down payments allowed in this program as well.\r\n                    Mortgage insurance can be removed once loan value reaches 80%\r\n                    This loan has many more options for condo financing\r\n                    Typically requires higher credit scores","page_11_text_9":"Jumbo","page_11_text_10":"Sometimes there are special programs, which have conventional first mortgage and jumbo loan second.\r\n                    Guidelines will vary from bank to bank and take slightly longer to approve","page_11_text_11":"Hard Money\/Private Financing","page_11_text_12":"These are loans, which do not necessarily require good credit from borrower in exchange for a higher interest rate and down payment\r\n                    Great option for homes that require repairs or have violations\r\n                    These loans also have shorter terms and may require payment within a year\r\n                    Very hard to get for owner occupants","page_11_text_13":"Seller Financing","page_11_text_14":"In some instances albeit rare, the seller can offer to extend a loan to you out of their equity\r\n                    The seller will need to have the home free and clear or enough equity to not receive the cash at closing","page_13_text_1":"While both older and newer homes have \r\n                    <span class=\"gold\">pros &<\/span> <b>cons,<\/b> considering them at the start of your search can help\r\n                guide you in the right direction","page_13_text_2":"Older Homes","page_13_text_3":"Usually located in centralized, urban locations. Within more established neighborhoods. Closer to shops, schools, etc.","page_13_text_4":"Cons -","page_13_text_5":"Typically do not have warranties as to conditions\r\n                    High insurance costs in some instances\r\n                    Have many unforeseen issues and repairs that can arise","page_13_text_6":"Pros -","page_13_text_7":"You can sometimes get a better value if willing to renovate\r\n                    Uniqueness and charm found in some homes\r\n                    Typically in well-established communities\r\n                    More variety in terms of style and architecture","page_13_text_8":"Newer Homes","page_13_text_9":"Usually located in suburbs, farther than away from city life. Tend to be in quieter areas. High technology usually included.","page_13_text_10":"Cons -","page_13_text_11":"Mostly in communities with HOA\r\n                    Limited options for design; builder fees\r\n                    Some new areas can have high taxes due to community development districts","page_13_text_12":"Pros -","page_13_text_13":"Special financing incentives\r\n                    Builders provide 1-10 year warranties; lower insurance costs\r\n                    Typically no repairs needed and able to move right in\r\n                    More energy efficient","page_15_text_1":"Some single-family homes and condos have associations","page_15_text_2":"Homeowners Association","page_15_text_3":"These associations set rules, regulations and typically appearance guidelines for homes within the association\r\n                    They create yearly budgets to cover these services and homeowners must pay dues in installments\r\n                    Some require the buyer to apply for approval prior to closing\r\n                    Has board of directors who manage the properties alongside management company\r\n                    Fees and rules can change with votes in community","page_15_text_4":"Condo Association","page_15_text_6":"Condos are similar to HOA’s but are more comprehensive in service\r\n                    Condos typically share insurance costs and have limited common elements that all owners have the right to use\r\n                    Some condos have both a condo association and a master homeowners association\r\n                    Fees and rules can change with votes in community\r\n                    In the event of major repairs or poor management, special assessments can be charged so we review documents and ﬁnancials for you","page_17_text_1":"Short Sale","page_17_text_2":"When an owner has ﬁnancial difﬁculty and falls into “pre-foreclosure”, the owner can request relief in the form of a short sale\r\n                    A short sale is when an owner needs to sell for less than what is owed on the home and ask the bank to approve a lower payoff to complete the sale\r\n                    Since the lender is not a party to the contract, they do not legally have to accept but many times will because it is in their best interest.\r\n                    The contracts are typically contingent on clear title unless otherwise indicated","page_17_text_3":"Foreclosures","page_17_text_4":"Repossessed homes which the bank is trying to liquidate\r\n                    It is considered a foreclosure once the bank owns it\r\n                    Also known as reo, bank-owned, foreclosed home\r\n                    Typically sold ‘As-Is’ condition with any and all violations\r\n                    You must follow bank guidelines to purchase the home\r\n                    They are typically contingent upon clear title unless otherwise indicated","page_17_text_5":"Foreclosure Court Auctions","page_17_text_6":"These are court ordered sales in an auction format\r\n                    Properties must be purchased in cash and paid in full within 24 hours from auction date\r\n                    These home have no title insurance and may have major title issues\r\n                    These home must be purchased site unseen and in an ‘As-Is Where Is’ condition","page_19_text_1":"Things to Keep in Consideration:","page_19_text_2":"Escrow Deposit -","page_19_text_3":"This is a good faith deposit to remove the home from the market and its availability to other purchasers. It is recommended to place at least 2% – 5% of sale price in escrow.","page_19_text_4":"Inspection -","page_19_text_5":"Your contract has a clause to add an inspection contingency if desired. We recommend it and if you are not satisfied with this condition, you can cancel and get your deposit returned.","page_19_text_6":"Financing Contingency -","page_19_text_7":"In the event you need a loan to purchase your home, we will add a financing contingency that allows you a certain amount of time to qualify and secure a loan commitment from a lender. If your loan is denied but time periods are met, your deposit will be returned.","page_19_text_8":"Appraisal -","page_19_text_9":"Whether cash or financing, we can add in an appraisal clause stating if the home appraises for less—you guessed it—you get your money back.","page_19_text_10":"Title -","page_19_text_11":"Our contracts are contingent upon clear title. There are some disputes regarding whether open permits are title issues so we will put in a clause protection against any open permits at the time of closing that you might assume.","page_19_text_12":"What Stays or What Goes from the Home -","page_19_text_13":"Typically all appliances and light fixtures stay with the home unless specified in the purchase and sale contract. Furniture and personal belongings are typically removed.","page_19_text_14":"The Condition of Home at Closing -","page_19_text_15":"The seller is required to keep the home in the same condition from when the home was shown unless repairs are negotiated.","page_19_text_16":"Closing Date -","page_19_text_17":"Make sure you negotiate enough time to close because the seller is not obligated to extend.","page_21_text_1":"So you found the one! What happens next is typically inspections.","page_21_text_2":"Many times the home inspection report will identify issues that need to be addressed. One of three things can happen:.","page_21_text_3":"You are happy with the condition of the home and decide to proceed to the next step of continuing with financing or to closing.","page_21_text_4":"You are happy with the condition of the home and decide to proceed to the next step of continuing with financing or to closing.","page_21_text_5":"You are happy with the condition of the home and decide to proceed to the next step of continuing with financing or to closing.","page_22_text_1":"If you’ve started looking for a home—and a real estate professional to assist you—your buyer’s representative may ask you to sign a Buyer Representation Agreement. What is this form? Why should you sign it?","page_22_text_2":"A Buyer Representation Agreement is a legal document that formalized your working relationship with a particular buyer’s representative, detailing what services you are entitled to and what your buyer’s rep expects from you in return. While the language used in the document is formal, homebuyers should view it as an important and helpful tool for clarifying expectations, developing mutual loyalty, and most importantly, elevating the services you will receive.","page_23_text_1":"Benefits\r\n                    of\r\n                    Signing a\r\n                    <strong>Buyer’s<\/strong> <span class=\"gold\">Representation Agreement<\/span>","page_23_text_2":"While the fiduciary duty really is the main reason to sign a Bey’s Rep Agreement, having one in place will also provide you with many benefits during your home search & purchase","page_23_text_3":"You are able to get a better idea of the scope of services the broker\/agent owes you as a client, as they are outlined in the agreement & discussed at time to signing.\r\n                    You will be treated as a client instead of a customer, therefore being entitled to superior services.\r\n                    With full attention, accountability & disclosure from your buyer’s rep, your best interests will be top priority during your search, negotiation & closing\r\n                    With a formalised agency agreement in place, you & your agent will be working as a team to make your home buying process a positive experience with positive results.","page_25_text_1":"Fernando","page_25_text_2":"J. Grullon","page_25_text_3":"Fernando is a Certiﬁed Residential Specialist (CRS) which is the highest credential awarded to residential sales agents, managers and brokers by the National Association of Realtors. Along with his successful real estate career, Fernando holds a Masters Degree in International Business Administration from Spain and a Law Degree from the Dominican Republic.<br><br>\r\n\r\n                    Fernando has served as a Council Member of the Young Professionals Network Leadership Board and as a State Director for the Miami Association of Realtors since 2016. He has been a Real Estate Professional in Miami since 2014, winning the Leading-Edge Society Award of BHHS Florida Realty in 2015, and recognized since 2016 as a \"Top Producer\" at Luxe Properties.<br><br>\r\n\r\n                    Fernando Grullon guides every client through the real estate process with empathy, commitment, and integrity, Offering them a pleasant experience and a memorable transaction frombeginning to end.","page_27_text_1":"6495 SW 15 TERRACE","page_27_text_2":"PRICE: $2,375,000","page_27_text_3":"BEDS\/BATHS: 6\/6","page_27_text_4":"LIVING AREA: 6,395 SQ FT","page_27_text_5":"LOT SIZE: 38,768 SQ FT","page_27_text_6":"6495 SW 15 TERRACE","page_27_text_7":"PRICE: $2,375,000","page_27_text_8":"BEDS\/BATHS: 6\/6","page_27_text_9":"LIVING AREA: 6,395 SQ FT","page_27_text_10":"LOT SIZE: 38,768 SQ FT","page_27_text_11":"6495 SW 15 TERRACE","page_27_text_12":"PRICE: $2,375,000","page_27_text_13":"BEDS\/BATHS: 6\/6","page_27_text_14":"LIVING AREA: 6,395 SQ FT","page_27_text_15":"LOT SIZE: 38,768 SQ FT","page_27_text_16":"6495 SW 15 TERRACE","page_27_text_17":"PRICE: $2,375,000","page_27_text_18":"BEDS\/BATHS: 6\/6","page_27_text_19":"LIVING AREA: 6,395 SQ FT","page_27_text_20":"LOT SIZE: 38,768 SQ FT","page_29_text_1":"6495 SW 15 TERRACE","page_29_text_2":"PRICE: $2,375,000","page_29_text_3":"BEDS\/BATHS: 6\/6","page_29_text_4":"LIVING AREA: 6,395 SQ FT","page_29_text_5":"LOT SIZE: 38,768 SQ FT","page_29_text_6":"6495 SW 15 TERRACE","page_29_text_7":"PRICE: $2,375,000","page_29_text_8":"BEDS\/BATHS: 6\/6","page_29_text_9":"LIVING AREA: 6,395 SQ FT","page_29_text_10":"LOT SIZE: 38,768 SQ FT","page_29_text_11":"6495 SW 15 TERRACE","page_29_text_12":"PRICE: $2,375,000","page_29_text_13":"BEDS\/BATHS: 6\/6","page_29_text_14":"LIVING AREA: 6,395 SQ FT","page_29_text_15":"LOT SIZE: 38,768 SQ FT","page_29_text_16":"6495 SW 15 TERRACE","page_29_text_17":"PRICE: $2,375,000","page_29_text_18":"BEDS\/BATHS: 6\/6","page_29_text_19":"LIVING AREA: 6,395 SQ FT","page_29_text_20":"LOT SIZE: 38,768 SQ FT","page_31_text_1":"- Mrs. Mercy","page_31_text_2":"\"Awesomeness Customer Services!!! Dedication and Total commitment to his client's, He help us with care to ﬁnd us our Home. We highly recommend Mrs. Fernando Grullon\"","page_31_text_3":"- Mrs. Mercy","page_31_text_4":"\"Awesomeness Customer Services!!! Dedication and Total commitment to his client's, He help us with care to ﬁnd us our Home. We highly recommend Mrs. Fernando Grullon\"","page_31_text_5":"- Mrs. Mercy","page_31_text_6":"\"Awesomeness Customer Services!!! Dedication and Total commitment to his client's, He help us with care to ﬁnd us our Home. We highly recommend Mrs. Fernando Grullon\"","page_2_img_1":"images\/home-buying\/page-1.jpg","page_5_img_1":"images\/home-buying\/page-5.jpg","page_6_img_1":"images\/home-buying\/page-6.jpg","page_7_img_1":"images\/home-buying\/page-7.jpg","page_10_img_1":"images\/home-buying\/page-10.jpg","page_12_img_1":"images\/home-buying\/page-12-1.jpg","page_12_img_2":"images\/home-buying\/page-12-2.jpg","page_14_img_1":"images\/home-buying\/page-14.jpg","page_16_img_1":"images\/home-buying\/page-16.jpg","page_18_img_1":"images\/home-buying\/page-16.jpg","page_20_img_1":"images\/home-buying\/page-20.jpg","page_22_img_1":"images\/home-buying\/page-22.jpg","page_24_img_1":"images\/home-buying\/page-24.jpg","page_26_img_1":"images\/home-buying\/page-26.jpg","page_27_img_1":"images\/home-buying\/page-27-1.jpg","page_27_img_2":"images\/home-buying\/page-27-2.jpg","page_27_img_3":"images\/home-buying\/page-27-3.jpg","page_27_img_4":"images\/home-buying\/page-27-4.jpg","page_28_img_1":"images\/home-buying\/page-28.jpg","page_29_img_1":"images\/home-buying\/page-27-1.jpg","page_29_img_2":"images\/home-buying\/page-27-2.jpg","page_29_img_3":"images\/home-buying\/page-27-3.jpg","page_29_img_4":"images\/home-buying\/page-27-4.jpg","page_30_img_1":"images\/home-buying\/page-30.jpg","page_31_img_1":"images\/home-selling\/Asset 27.png","page_31_img_2":"images\/home-selling\/Asset 27.png","page_31_img_3":"images\/home-selling\/Asset 27.png"}