{"page_1_1_text_1":"THE","page_1_1_text_2":"HOME","page_1_1_text_3":"SELLING","page_1_1_text_4":"GUIDE","page_2_2_text_1":"A New Breed of Realtors Redefining","page_2_2_text_2":"The Real Estate","page_2_2_text_5":"Experience","page_2_2_text_3":"At LUXE Properties, we take pride in building relationships based on the premise and understanding that each client is unique, along with their respective properties. We aim to delight and surprise our clients, deliver exceptional service and exceed expectations throughout the transaction. Our company utilizes the latest technology to stay abreast of market trends and deliver innovative solutions for our LUXE clients.","page_2_2_text_4":"The LUXE Properties team seeks to partner with you every step of the way. So, whether you are buying, selling, or considering real estate in South Florida, LUXE Properties is here to make your LUXE real estate experience your best move yet.","page_3_2_text_1":"Key","page_3_2_text_2":"Objectives","page_3_2_text_3":"When Listing Your Home","page_3_2_text_4":"For The Highest Possible Price","page_3_2_text_5":"Utilizing our pricing strategy along with our in-house appraisal services, LUXE agents ensure your home is properly valued to garner maximum exposure in the marketplace. Our pricing approach together with our tailored marketing program increases demand resulting in a higher sales price for our listings.","page_3_2_text_6":"In The Shortest Amount Of Time","page_3_2_text_7":"The ability to advise on market timing is one of LUXE’s competitive advantages. Our custom marketing program is consistent and predictable giving us a number of reliable metrics that can help identify how long it will take each listing to sell. The majority of the homes sold with LUXE in 2017 closed in 90 days or less.","page_3_2_text_8":"With The Least Hassle","page_3_2_text_9":"Once you list with LUXE, you can sit back and relax. Our specialized departments cover all aspects of the home sale process from marketing your home all the way up to closing. Our company has a “let us handle that for you” approach to the sale. We’ve redefined our process so precisely that nothing falls through the cracks.","page_4_2_text_1":"4","page_4_2_text_2":"LOCATIONS","page_4_2_text_3":"325","page_4_2_text_4":"REAL ESTATE AGENTS","page_4_2_text_5":"61","page_4_2_text_6":"% GROWTH 2019","page_4_2_text_7":"67","page_4_2_text_8":"DAYS ON MARKET","page_4_2_text_9":"3500","page_4_2_text_10":"HOMES SOLD","page_4_2_text_11":"98","page_4_2_text_12":"% LIST TO SALE PRICE","page_4_2_text_13":"The LUXE Properties team has unparalleled history with successful home sales in the Greater Miami area. We have sold nearly 2,100 homes on average within less than 90 days. Our team delivers exceptional results.","page_5_2_text_1":"Our specialized agents and marketing team work together to ensure your home is properly positioned in the marketplace for maximum exposure, both digitally and in print.","page_5_2_text_2":"Each property listing is marketed using the personalized materials below:","page_5_2_text_3":"Personalized website of home listing\r\nProfessional HD Videos\r\nProfessional HD Photography\r\nProfessional Drone Videography\r\nCustom reporting on specific buyer profiles for each listing\r\nDirect Mail Marketing to targeted demographics\r\nEmail Campaigns to targeted demographics\r\nPPC Google campaign to targeted demographics\r\nTargeted advertising in China, South America and Europe\r\nTargeted Social Media Advertising\r\nSyndication to over 100 online portals\r\nPremium placement on all major real estate portals includ- ing Zillow, Trulia & Realtor.com\r\nInternational MLS Marketing\r\nPrint advertisements in local newspaper and magazines\r\nBroker’s Open\r\nBi-weekly Open Houses\r\nSignage including web domain riders","page_5_2_text_4":"Our marketing will maximize interest through our personalized campaigns created exclusively for your home, which will assist in achieving the greatest results.","page_6_2_text_1":"Signage is placed\r\nPhotography & video session\r\nHome is listed on MLS + International MLS\r\nPersonalized website created for home\r\nMake sure listing syndicated to all sites","page_6_2_text_2":"Email blast campaign\r\nVirtual tour posted on YouTube and shared\r\nBlog post with Facebook sponsored ad\r\nAdditional Social Media Posts\r\nOpen House (if applicable)","page_6_2_text_3":"Open houses\r\nTargeted email campaign to area's owners\r\nBrokers' open for select agents who specialize in the area\r\nBegin preparing direct mail piece","page_6_2_text_4":"Direct mail is sent\r\nPersonal outreach to other agents\r\nOpen houses\r\nContinually monitor social media posts, blog posts and websites for potential buyers","page_6_2_text_5":"Open Houses\r\nMonitor PPC for listing\r\nReview analytics for Facebook Sponsored Ad\r\nRevise website and social media postings\r\nReview with client to make adjustments if needed","page_7_2_text_1":"Professional","page_7_2_text_2":"Photography","page_7_2_text_3":"Professional","page_7_2_text_4":"Videography","page_7_2_text_5":"Optional Drone","page_7_2_text_6":"Videography","page_7_2_text_7":"LUXE listings receive the luxury treatment from beginning to end. It is proven that listings with professional real estate photographs sell 32% faster and at a higher price. All homes listed with LUXE include professional photography along with staging recommendations from our agents. These stunning high quality images of the interior\/exterior of your property will be the cornerstone of our marketing materials, inviting homebuyers to want to see more of your home.","page_7_2_text_8":"As we continuously seek to maximize awareness of your home, we have incorporated virtual tours for the buyer on the go or international buyers. YouTube has rapidly become the number one online video site making our channel the perfect online video destination for limitless exposure of the properties represented by our team. With video being 53% more likely to generate a first-page Google ranking, we optimize each tour towards its target market based on location and demographics.","page_7_2_text_9":"Through the use of drone footage combined with high-definition videography, we are able to create stunning aerial tours for each of our exclusive listings. Our drone videography offers panoramic views of a property to showcase its exterior amenities such as pools, the footprint of the home and surrounding areas of interest.","page_8_2_text_1":"Our clients benefit from property exposure through shared listing syndication on a carefully chosen list of top real estate websites syndication on a carefully chosen list of top real estate websites and desired neighborhood websites where potential buyers frequently gather real estate information when looking for a home aided in choosing these distinct portals.","page_8_2_text_2":"All our syndication portals display your home with:","page_8_2_text_3":"Mobile Optimization\r\nDaily Updates\r\nLocal Information on Area\r\nProperty Information","page_8_2_text_4":"In addition to listing syndication, custom reporting will be provided for every channel to show how much exposure each listing is receiving from every channel to show how much exposure each listing is receiving from featured when possible on each of these online channels to ensure featured when possible on each of these online channels to ensure","page_8_2_text_5":"Custom reporting includes:","page_8_2_text_6":"Listing Views\r\nSearch List Views\r\nProperty Details Views\r\nSaved Searches","page_9_2_text_1":"Pushing for unparalleled exposure for every LUXE Property client, each home listed with LUXE Properties receives a personalized website. Complete with its own unique domain of your street address, this site will also be syndicated to more than 30 major property search portals such as Zillow, Trulia and Realtor.com. This link, while highlighting a property’s best features, allows us to showcase the home with ease. The exclusive domain will provide a personalized site that does not feature any other competitive homes.","page_9_2_text_2":"These striking sites include all of the most important marketing features of your home and the latest online capabilities including:","page_9_2_text_3":"Property Details\r\nSchools in Area\r\nVideo and Photo Showcase\r\nMap","page_9_2_text_4":"Custom Domain\r\nSearch Engine Optimization\r\nLead Capture Tools\r\nMobile Optimization","page_9_2_text_5":"This powerful online marketing tool impresses buyers and when  advertised in print or online, gets interested buyers to the information they seek instantly.","page_10_1_text_1":"www.LUXEknows.com","page_10_1_text_2":"www.LUXEknows.com","page_10_2_text_1":"Having a strong online presence has widely become one of the most important tools in real estate, with 90% of buyers starting their home search online. LUXE Properties is committed to maintaining a powerful online presence fueled by engagement and up-to-date information on trends in the marketplace through our various proprietary websites as well as our social media outlets.","page_10_2_text_2":"www.LUXEknows.com","page_10_2_text_3":"Our principal website features various content, from our exclusive listings to agent profiles and our blog posts. Here you can access our agent’s biographies, get in contact with any member of our team, and browse the MLS. We utilize our blog to showcase our latest listings, which are shared to various social media and online outlets. Many of our home listings are shared over 200 times throughout the web.","page_10_2_text_4":"www.allmiamihousesforsale.com","page_10_2_text_5":"Our fully integrated MLS portal allows any user to receive a personalized response quickly via phone or email from one of our professional agents, be notified of new properties that match the user’s preferences, have the ability to save favorites and searches for easier access, request showings or more information on any listing and subscribe to customized property alerts. All LUXE listings are featured on this site and marketed using exclusive Pay-Per-Click campaigns.","page_11_1_text_1":"3504 MAIN LODGE DR • MIAMI • FLORIDA","page_11_1_text_2":"This is a single family home that contains 7,178 sq ft and was built in 2008. It contains 7 bedrooms and 7 bathrooms. Spectacular Estate Home in the extremely exclusive neighborhood of Camp Biscayne, This home offers a lifestyle of maximum privacy and security while being just steps from the best that Coconut Grove provides. Walking distance to the best schools, shopping and resturants.","page_11_1_text_3":"$4,499,000","page_11_2_text_1":"Direct Mail Marketing","page_11_2_text_2":"Once a home is listed with LUXE Properties, our in-house marketing specialists get to work on designing a personalized marketing piece announcing the sale of your property. Targeted direct mail has a 495% increased response rate compared to traditional print direct mail. Through a comprehensive analysis of neighborhood homes sales and specific demographics, our marketers are able to identify the profile of a property’s most probable purchaser. In addition to targeted direct mail, we also focus on your surrounding neighborhood to reach the biggest endorsers for the area, your neighbors. Your neighbors may have friends and families who desire to live nearby.","page_11_2_text_3":"Luxury Brochures","page_11_2_text_4":"Each LUXE listing receives a personalized luxury brochure placed in the home for any broker’s open, showings or open houses. These luxury brochures include high-quality images of the home and a list of features and amenities. These brochures ensure your home is memorable and at the forefront as buyers enter and leave. They aid buyers and their agents overcome most objections and questions before even leaving the home.","page_11_2_text_5":"Floor Plans","page_11_2_text_6":"LUXE Properties offers customized floor plan services to effectively engage buyer’s interest in your property. When just viewing real estate photos online, it can be difficult for buyersee how the home’s layout flows. Floor plans help display where rooms are located in context to one another and provide an idea of important details, such as the way the space is oriented.","page_12_2_text_1":"Social media influence has continuously become one of our great-est assets. Whether it is through promotion of our newest listings or interaction with our followers, our connection to social media elicits another outlet of promotion for all properties listed with LUXE.","page_12_2_text_2":"It has increasingly become one of our greatest tools to market not only our exclusive listings but also our closings, referrals, and testimonials to gain an engaged following.","page_12_2_text_3":"Luxe Properties Stats","page_12_2_text_4":"30,000+ followers across Twitter, LinkedIn, and Instagram\r\n9,000+ Views on Youtube channel\r\n3,000+ Likes on Facebook; 10,000+ users reached","page_12_2_text_5":"With a steadily growing following on all our social media channels, Facebook Sponsored Ads add another dimension to our reach. Our Facebook Ads are highly targeted to attract the most qualified buyers and interested parties.","page_12_2_text_6":"app.luxeknows.com\/luxe\/","page_12_2_text_7":"@luxepropertiesmia","page_12_2_text_8":"LUXE Properties, LLC.","page_12_2_text_9":"@luxepropertiesmia","page_12_2_text_10":"@luxeproperties","page_12_2_text_11":"linkedin.com\/company\/luxe-properties-llc","page_12_2_text_12":"pinterest.com\/luxeproperties","page_12_2_text_13":"youtube.com\/c\/LUXEProperties","page_13_2_text_1":"Broker’s Open","page_13_2_text_2":"The LUXE Properties team will host a broker’s open event for select agents who specialize in the area. This will bring cooperating agents and firms together, condensing some of the showing activi-ty into a set timeframe. These events allow us to receive immedi-ate authentic feedback on the home, its price and its competitive qualities when compared to the other homes on the market. Our broker’s open events are marketed through the following avenues:","page_13_2_text_3":null,"page_13_2_text_4":"Broker’s Open","page_13_2_text_5":"Public open houses will also be hosted on various weekends in order to ensure we are attracting buyers via every possible avenue. In a study by the National Association of Realtors, 45% of buyers attended open houses as a source of information. The more exposure, the better and this will continually increase the velocity of the sale of your property. Our open houses are marketed through the following avenues:","page_13_2_text_6":null,"page_15_2_text_1":"LINA","page_15_2_text_2":"SARDINAS","page_15_2_text_3":"Lina is a communicator by profession, and seller by passion. Her personality is charismatic, generous, enterprising and helpful but most importantly, her integrity and loyalty have brought her recognition as a top seller.\r\nShe is from the capital of flowers in Colombia, where she first began to earn her real estate business experience.\r\nShe has lived in Miami with her family since 2009, first in Brickell and presently in Key Biscayne. She is a mother of two who is extremely active in her community and immersed in the multi-cultural environment.","page_15_2_text_4":"Lina has a young spirit, always looking for the opportunity to learn and innovate with positive energy and natural ability for interior design.\r\nProfessionally she has developed as a Salesperson, TV anchor and Marketing professional, in charge of developing and executing sales strategies, anchoring live television weekly broadcast, promoting luxury real estate projects and promoting a variety of products for multinational companies.\r\nAs a realtor, Lina is always well informed about market trends. Her goal, above all, is to be of great help to her clients, providing them with an advantage in the Miami real estate market.","page_15_2_text_5":"Lina guides every client through the real estate process with empathy, commitment, and integrity, Offering them a pleasant experience and a memorable transaction from beginning to end.","page_16_2_text_1":"6495 SW 15 TERRACE","page_16_2_text_2":"PRICE: $2,375,000","page_16_2_text_3":"BEDS\/BATHS: 6\/6","page_16_2_text_4":"LIVING AREA: 6,395 SQ FT","page_16_2_text_5":"LOT SIZE: 38,768 SQ FT","page_16_2_text_6":"6495 SW 15 TERRACE","page_16_2_text_7":"PRICE: $2,375,000","page_16_2_text_8":"BEDS\/BATHS: 6\/6","page_16_2_text_9":"LIVING AREA: 6,395 SQ FT","page_16_2_text_10":"LOT SIZE: 38,768 SQ FT","page_16_2_text_11":"6495 SW 15 TERRACE","page_16_2_text_12":"PRICE: $2,375,000","page_16_2_text_13":"BEDS\/BATHS: 6\/6","page_16_2_text_14":"LIVING AREA: 6,395 SQ FT","page_16_2_text_15":"LOT SIZE: 38,768 SQ FT","page_16_2_text_16":"6495 SW 15 TERRACE","page_16_2_text_17":"PRICE: $2,375,000","page_16_2_text_18":"BEDS\/BATHS: 6\/6","page_16_2_text_19":"LIVING AREA: 6,395 SQ FT","page_16_2_text_20":"LOT SIZE: 38,768 SQ FT","page_17_2_text_1":"6495 SW 15 TERRACE","page_17_2_text_2":"PRICE: $2,375,000","page_17_2_text_3":"BEDS\/BATHS: 6\/6","page_17_2_text_4":"LIVING AREA: 6,395 SQ FT","page_17_2_text_5":"LOT SIZE: 38,768 SQ FT","page_17_2_text_6":"DAYS ON MARKET: 7","page_17_2_text_7":"6495 SW 15 TERRACE","page_17_2_text_8":"PRICE: $2,375,000","page_17_2_text_9":"BEDS\/BATHS: 6\/6","page_17_2_text_10":"LIVING AREA: 6,395 SQ FT","page_17_2_text_11":"LOT SIZE: 38,768 SQ FT","page_17_2_text_12":"DAYS ON MARKET: 7","page_17_2_text_13":"6495 SW 15 TERRACE","page_17_2_text_14":"PRICE: $2,375,000","page_17_2_text_15":"BEDS\/BATHS: 6\/6","page_17_2_text_16":"LIVING AREA: 6,395 SQ FT","page_17_2_text_17":"LOT SIZE: 38,768 SQ FT","page_17_2_text_18":"DAYS ON MARKET: 7","page_17_2_text_19":"6495 SW 15 TERRACE","page_17_2_text_20":"PRICE: $2,375,000","page_17_2_text_21":"BEDS\/BATHS: 6\/6","page_17_2_text_22":"LIVING AREA: 6,395 SQ FT","page_17_2_text_23":"LOT SIZE: 38,768 SQ FT","page_17_2_text_24":"DAYS ON MARKET: 7","page_18_2_text_1":"\"Awesomeness Customer Services!!! Dedication and Total commitment to his client's, He help us with care to ﬁnd us our Home. We highly recommend Mrs. Fernando Grullon\"","page_18_2_text_2":"- Mrs. Mercy","page_18_2_text_3":"\"Awesomeness Customer Services!!! Dedication and Total commitment to his client's, He help us with care to ﬁnd us our Home. We highly recommend Mrs. Fernando Grullon\"","page_18_2_text_4":"- Mrs. Mercy","page_18_2_text_5":"\"Awesomeness Customer Services!!! Dedication and Total commitment to his client's, He help us with care to ﬁnd us our Home. We highly recommend Mrs. Fernando Grullon\"","page_18_2_text_6":"- Mrs. Mercy","page_2_1_img_1":"images\/home-selling\/listing_one.jpg","page_3_1_img_1":"images\/home-selling\/page-3.png","page_4_1_img_1":"images\/home-selling\/Asset 8.png","page_5_1_img_1":"images\/home-selling\/Asset 10.png","page_6_1_img_1":"images\/home-selling\/Asset 11.png","page_7_1_1_img_1":"images\/home-selling\/Asset 13-1.png","page_7_1_2_img_1":"images\/home-selling\/Asset 13-2.png","page_7_1_3_img_1":"images\/home-selling\/Asset 13-3.png","page_9_1_img_1":"images\/home-selling\/Asset 15.png","page_10_1_img_1":"images\/home-selling\/Asset 16-1.png","page_10_1_img_2":"images\/home-selling\/Asset 16-2.png","page_11_1_img_1":"images\/home-selling\/Asset 17.jpg","page_11_1_img_2":"images\/home-selling\/Asset 18-1.jpg","page_11_1_img_3":"images\/home-selling\/Asset 18-2.jpg","page_11_1_img_4":"images\/home-selling\/Asset 18-3.jpg","page_11_1_img_5":"images\/home-selling\/Asset 18-4.jpg","page_11_1_img_6":"images\/home-selling\/Asset 18-5.jpg","page_11_1_img_7":"images\/home-selling\/Asset 18-6.jpg","page_12_img_1":"images\/home-selling\/Asset 19.png","page_13_img_1":"images\/home-selling\/Asset 20.png","page_14_img_1":"images\/home-selling\/Asset 21.png","page_15_img_1":"uploadedimages\/2b84cc9e-dfb5-43af-ac56-9608a40ee94d.png","page_16_img_1":"images\/home-selling\/Asset 24.png","page_16_2_img_1":"images\/home-selling\/Asset 24-1.jpg","page_16_2_img_2":"images\/home-selling\/Asset 24-2.jpg","page_16_2_img_3":"images\/home-selling\/Asset 24-3.jpg","page_16_2_img_4":"images\/home-selling\/Asset 24-4.jpg","page_17_img_1":"images\/home-selling\/Asset 25.png","page_17_2_img_1":"images\/home-selling\/Asset 24-1.jpg","page_17_2_img_2":"images\/home-selling\/Asset 24-1.jpg","page_17_2_img_3":"images\/home-selling\/Asset 24-1.jpg","page_17_2_img_4":"images\/home-selling\/Asset 24-1.jpg","page_18_img_1":"images\/home-selling\/Asset 26.png","page_19_img_1":"images\/home-selling\/Asset 27.png","page_19_img_2":"images\/home-selling\/Asset 27.png","page_19_img_3":"images\/home-selling\/Asset 27.png"}